# Телеграм-бот для приема платежей на Flask с нуля
# Фреймворк Flask будет использоваться для создания web-сервера для этой задачи. 

# Flask - популярный фреймворк для разработки серверных приложений на Python
# Более легковесный и простой, чем Django
# Несложное приложение - Flask
# Django - сложное и большое приложение

# Чтобы создать телеграм-бота, нам необходимо открыть Telegram и найти в нем Telegram-бота, который называется 
# BotFather, запустить его и набрать в нем команду /newbot и придумать ему некоторое уникальное название
